Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །རབ་འབྱོར་ཚད་མེད་པ་ཞེས་བྱ་བ་ནི་གང་གཞལ་བར་མི་ནུས་པའོ།
en: Subhūti, the term immeasurable suggests that which cannot be evaluated.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་རྣམ་གྲངས་གང་གིས་གཟུགས་ཀྱང་གྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་ཚད་མ་མཆིས་པར་འགྱུར་ཞིང་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་གྲངས་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་ཚད་མ་མཆིས་པར་འགྱུར་བའི་རྣམ་གྲངས་དེ་ལྟ་བུ་མཆིས་སམ།
en: Blessed Lord, is there a reason why physical forms are incalculable, inestimable, and immeasurable, and why feelings, perceptions, formative predispositions, and consciousness are also incalculable, inestimable, and immeasurable?” {

source: རབ་འབྱོར་རྣམ་གྲངས་གང་གིས་གཟུགས་ཀྱང་གྲངས་མེད་དཔག་ཏུ་མེད་ཚད་མེད་པར་འགྱུར་བ་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་གྲངས་མེད་དཔག་ཏུ་མེད་ཚད་མེད་པར་འགྱུར་བའི་རྣམ་གྲངས་དེ་ལྟ་བུ་ཡོད་དོ།
en: IV: 172} “Subhūti,” replied the Blessed One, “there is indeed a reason why physical forms are incalculable, inestimable, and immeasurable, and why feelings, perceptions, formative predispositions, and consciousness are also incalculable, inestimable, and immeasurable.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་རྣམ་གྲངས་གང་གིས་ན་གཟུགས་ཀྱང་གྲངས་མ་མཆིས། དཔག་ཏུ་མ་མཆིས་ཚད་མ་མཆིས་པར་འགྱུར་བ་ལགས།
en: Blessed Lord, why then are physical forms incalculable, inestimable, and immeasurable?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་གྲངས་མ་མཆིས། དཔག་ཏུ་མ་མཆིས་ཚད་མ་མཆིས་པར་འགྱུར་བ་ལགས།
en: Why are feelings, perceptions, formative predispositions, and consciousness also incalculable, inestimable and immeasurable?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་ཀྱང་སྟོང་པ་སྟེ། གྲངས་མེད་དཔག་ཏུ་མེད་ཚད་མེད་པའོ།
en: Subhūti,” replied the Blessed One, “insofar as physical forms are empty, they are incalculable, inestimable, and immeasurable.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡང་སྟོང་པ་སྟེ། གྲངས་མེད་དཔག་ཏུ་མེད་ཚད་མེད་པའོ། གསོལ་པ།
en: Insofar as feelings, perceptions, formative predispositions, and consciousness are empty, they are also incalculable, inestimable, and immeasurable.” “

source: བཅོམ་ལྡན་འདས་གཟུགས་འབའ་ཞིག་སྟོང་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་འབའ་ཤིག་སྟོང་དུ་བས་ཀྱི། ཆོས་ཐམས་ཅད་སྟོང་པ་མ་ལགས་སམ།
en: Blessed Lord, is it only physical forms that are empty, and is it only feelings, perceptions, formative predispositions, and consciousness that are empty, or are all phenomena not empty?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། ངས་ཆོས་ཐམས་ཅད་སྟོང་པའོ་ཞེས་མ་བཤད་དམ།
en: Subhūti, do you think that I have not explained all phenomena to be empty?”

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཆོས་ཐམས་ཅད་སྟོང་པའོ་ཞེས་གསུངས་ཏེ།
en: Blessed Lord, the Tathāgata has taught that all phenomena are empty.

source: སྟོང་པ་ཉིད་གང་ལགས་པ་དེ་ནི་མི་བས་པ་སྟེ།
en: That which is just empty is inexhaustible.

source: གྲངས་མ་མཆིས་པ་ཡང་དེ་ལགས། དཔག་ཏུ་མ་མཆིས་པ་ཡང་དེ་ལགས་ཚད་མ་མཆིས་པ་ཡང་དེ་ལགས་ཏེ།
en: Thus it is also incalculable, it is also inestimable, and it is also immeasurable.

source: བཅོམ་ལྡན་འདས་སྟོང་པ་ཉིད་ལ་ནི་གྲངས་ཀྱང་མི་དམིགས། དཔག་པ་ཡང་མི་དམིགས། ཚད་ཀྱང་མི་དམིགས་ཏེ།
en: Blessed Lord, no number is apprehended, no estimate is apprehended, and no measure is apprehended.

source: བཅོམ་ལྡན་འདས་དེ་བས་ན་ཆོས་དེ་དག་ལ་དོན་ཏམ་ཡི་གེས་ཐ་དད་དུ་བགྱི་བ་མི་དམིགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: So it is, Blessed Lord, that no difference between these phenomena is apprehended, whether in meaning or in enunciation.” “

source: ཆོས་དེ་དག་ལ་དོན་ཏམ་ཡི་གེས་ཐ་དད་དུ་བྱ་བ་མི་དམིགས་སོ། །རབ་འབྱོར་མི་ཟད་པ་ཞེས་བྱ་བ་འམ་ཚད་མེད་པ་ཞེས་བྱ་བ་འམ་སྟོང་པ་ཞེས་བྱ་བ་འམ་མཚན་མ་མེད་པ་ཞེས་བྱ་བ་འམ། སྨོན་པ་མེད་པ་ཞེས་བྱ་བ་འམ།
en: No difference between these phenomena is apprehended, whether in meaning or in enunciation.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་ཞེས་བྱ་བ་འམ། སྐྱེ་བ་མེད་པ་ཞེས་བྱ་བ་འམ། འདོད་ཆགས་དང་བྲལ་བ་ཞེས་བྱ་བ་འམ། འགག་པ་མེད་པ་ཞེས་བྱ་བ་འམ། མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་འདི་ནི་བརྗོད་དུ་མེད་པ་ལས་དེ་བཞིན་གཤེགས་པས་བརྗོད་དེ།
en: Subhūti, the terms inexhaustible, immeasurable, empty, signless, wishless, unconditioned, nonarising, unattached, nonceasing, and nirvāṇa are expressions used by the Tathāgata that issue from their inexpressibility.

source: མི་ཟད་པ་ཞེས་བྱ་བ་འམ། མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བའི་བར་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་མངོན་པར་བསྒྲུབ་པར་བཤད་པའོ།
en: It is explained that these terms, from inexhaustible to nirvāṇa, make manifest the teaching of the tathāgatas.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཆོས་རྣམས་ཀྱི་ཆོས་ཉིད། དེ་བཞིན་གཤེགས་པས་བསྟན་ལ་ཆོས་ཉིད་དེ་ཡང་བརྗོད་དུ་མ་མཆིས་པ་ནི་ངོ་མཚར་ཆེའོ།
en: Blessed Lord, how wonderful it is that the reality of all phenomena has been revealed by the tathāgatas, although this reality is inexpressible!

source: །བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན། བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ནི་བརྗོད་དུ་མ་མཆིས་པའོ།
en: As I understand the meaning of the teachings given by the Blessed One, all phenomena, Blessed Lord, are inexpressible.” {

source: རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་བརྗོད་དུ་མེད་པའོ།
en: Subhūti, all phenomena are inexpressible.

source: །རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཀྱི་བརྗོད་དུ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྟོང་པ་ཉིད་དེ།
en: Subhūti, the inexpressibility of all phenomena is emptiness.

source: སྟོང་པ་ཉིད་ལ་ནི་བརྗོད་པ་གང་ཡང་མེད་དོ། །སྟོང་པ་ཉིད་ནི་བརྗོད་པར་མི་ནུས་སོ། །གསོལ་པ།
en: In emptiness, nothing at all is expressed, and emptiness cannot be expressed.” “

source: བཅོམ་ལྡན་འདས་བརྗོད་དུ་མ་མཆིས་པའི་དོན་ལ་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མཆིས་སམ།
en: Blessed Lord, can an object that is inexpressible increase or decrease?” “No, Subhūti!”

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ཏེ། རབ་འབྱོར་བརྗོད་དུ་མེད་པའི་དོན་ལ་ནི་འཕེལ་བའམ་ཡོངས་སུ་འགྲིབ་པ་མེད་དོ།
en: An object that is inexpressible neither increases nor decreases.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་བརྗོད་དུ་མ་མཆིས་པའི་དོན་ལ་འཕེལ་བ་དང་། ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་ན་བཅོམ་ལྡན་འདས་དེས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་པར་འགྱུར་རོ།
en: Blessed Lord, if an object that is inexpressible neither increases nor decreases, then, Blessed Lord, the perfection of generosity would neither increase nor decrease.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་པར་འགྱུར་རོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom would neither increase nor decrease.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ཡང་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་པར་འགྱུར་རོ།
en: The four applications of mindfulness would neither increase nor decrease.

source: །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་པར་འགྱུར་རོ། །འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path would neither increase nor decrease.

source: གཟུགས་མེད་པའི་སྙོམ་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཡང་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་པར་འགྱུར་རོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, and the meditative stabilities of emptiness, signlessness, and wishlessness would neither increase nor decrease.

source: །མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་པར་འགྱུར་རོ།
en: The extrasensory powers, the meditative stabilities, and the dhāraṇī gateways would neither increase nor decrease.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱང་འཕེལ་བ་དང་ཡོངས་སུ་འགྲིབ་པ་མ་མཆིས་པར་འགྱུར་རོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas would neither increase nor decrease.

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་གྱུར་ན་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་མ་མཆིས་པར་འགྱུར་རོ།
en: Blessed Lord, if that were the case, the six perfections would be nonexistent. [

source: །སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་དུ་མ་མཆིས་པར་འགྱུར་རོ།
en: The attributes], up to and including the eighteen distinct qualities of the buddhas, would be nonexistent.

source: །ཆོས་དེ་དག་མ་མཆིས་པས་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་མ་མཆིས་པར་འགྱུར་རོ།
en: If all phenomena were nonexistent, all-aspect omniscience would also be nonexistent.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་མ་མཆིས་ན། སུ་ཞིག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: If all-aspect omniscience were nonexistent, who would attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: བརྗོད་དུ་མེད་པའི་དོན་ལ་ནི་འཕེལ་བའམ་ཡོངས་སུ་འགྲིབ་པ་མེད་དོ།
en: Subhūti, an object that is inexpressible neither increases nor decreases.

source: །རབ་འབྱོར་གལ་ཏེ་ཐབས་མཁས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྒོམ་པ་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱེད་པའི་ཚེ། འདི་སྙམ་དུ་བདག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པས་རྣམ་པར་འཕེལ་ལོ།
en: Subhūti, if bodhisattva great beings who are skilled in means practice the perfection of wisdom, cultivate the perfection of wisdom, and persevere in the perfection of wisdom, they do not think, ‘I am enhanced by the perfection of wisdom.

source: བདག་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: I am enhanced by the perfection of meditative concentration.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པས་རྣམ་པར་འཕེལ་ལོ།
en: I am enhanced by the perfection of generosity.’

source: །སྙམ་དུ་མི་སེམས་ཤིང་འོན་ཀྱང་དེ་འདི་སྙམ་དུ་འདི་ལྟ་སྟེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མིང་ཙམ་མོ།
en: On the other hand, they do think, ‘This perfection of generosity is merely a name. {Ki.

source: །འདི་ལྟ་སྟེ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མིང་ཙམ་མོ།
en: IV: 174} These perfections of ethical discipline, tolerance, perseverance, meditative concentration, and wisdom are merely names.’

source: སྙམ་ཞིང་དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ་ཡིད་ལ་བྱེད་པ་དེ་དག་དང་། སེམས་བསྐྱེད་པ་དེ་དག་དང་། དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་སྟེ། དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཇི་ལྟ་བ་བཞིན་དུ་ཡོངས་སུ་བསྔོའོ།
en: When they practice the perfection of generosity, they dedicate their attention, their setting of the mind on enlightenment, and their roots of virtuous action to unsurpassed, complete enlightenment, and they make this dedication definitively, in accordance with unsurpassed, complete enlightenment.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཇི་ལྟ་བུ་ལགས།
en: Blessed Lord, what is the nature of unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ། །གསོལ་པ།
en: Subhūti, the real nature of all phenomena is unsurpassed, complete enlightenment,” replied the Blessed One. “

source: བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལགས།
en: Blessed Lord, of what is the real nature unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ།
en: Subhūti,” replied the Blessed One, “the real nature of physical forms is unsurpassed, complete enlightenment.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ།
en: The real nature of feelings, perceptions, formative predispositions, and consciousness is unsurpassed, complete enlightenment.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ།
en: The real nature of the sense fields, sensory elements, and links of dependent origination is unsurpassed, complete enlightenment.

source: །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ།
en: The real nature of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment is unsurpassed, complete enlightenment.

source: །འཕགས་པའི་བདེན་པ་རྣམས་དང་བསམ་གཏན་རྣམས་དང་ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་དང་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ།
en: The real nature of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways is unsurpassed, complete enlightenment.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་མི་འཇིགས་པ་རྣམས་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ།
en: The real nature of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas is unsurpassed, complete enlightenment.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་བོ།
en: The real nature of [the goals], up to and including all-aspect omniscience, is unsurpassed, complete enlightenment.

source: །མྱ་ངན་ལས་འདས་པའི་དེ་བཞིན་ཉིད་གང་ཡིན་པ་དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་སྟེ།
en: The real nature of nirvāṇa is unsurpassed, complete enlightenment.

source: དེ་ནི་འཕེལ་བ་ཡང་མེད་དོ།
en: That [real nature] neither increases nor decreases. “

source: །ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ། །རབ་འབྱོར་དེ་ལ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་མ་བྲལ་བ་རྒྱུན་མི་འཆད་པར་རྟག་ཏུ་རྣམ་པར་སྤྱོད་དེ། ཆོས་གང་ལ་ཡང་འཕེལ་བའམ་ཡོངས་སུ་འགྲིབ་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: Subhūti, in the case of bodhisattva great beings who constantly and uninterruptedly act without lacking the perfection of wisdom, they do not observe anything that increases or decreases.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བརྗོད་དུ་མེད་པའི་དོན་ནི་འཕེལ་བ་མེད་ཅིང་ཡོངས་སུ་འགྲིབ་པ་མེད་པ་སྟེ།
en: So it is, Subhūti, that an inexpressible object is without increase or decrease.

source: རབ་འབྱོར་དེ་ལྟར་ན་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་འཕེལ་བ་ཡང་མེད་ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ།
en: Thus, Subhūti, the perfection of generosity is without increase or decrease.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་འཕེལ་བ་ཡང་མེད་ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ།
en: The perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are also without increase or decrease.

source: །ནང་སྟོང་པ་ཉིད་ལ་འཕེལ་བ་ཡང་མེད་ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ།
en: The emptiness of internal phenomena is also without increase or decrease. [

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་འཕེལ་བ་ཡང་མེད་ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ།
en: The other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are also without increase or decrease.

source: །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་འཕེལ་བ་ཡང་མེད་ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ།
en: The applications of mindfulness are also without increase or decrease.

source: །ཡང་དག་པར་སྤོང་བ་རྣམས་དང་རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་སྟོབས་རྣམས་དང་བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་འཕེལ་བ་ཡང་མེད་ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ།
en: The correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path are also without increase or decrease.

source: འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways are also without increase or decrease.

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་འཕེལ་བ་ཡང་མེད། ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་འཕེལ་བ་ཡང་མེད་ཡོངས་སུ་འགྲིབ་པ་ཡང་མེད་དོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas are also without increase or decrease.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་འཕེལ་བ་མེད་པ་དང་། ཡོངས་སུ་འགྲིབ་པ་མེད་པའི་ཚུལ་གྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: So it is, Subhūti, that bodhisattva great beings should practice the perfection of wisdom by way of nonincrease and nondecrease.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཅི་ལགས་སེམས་དང་པོ་བསྐྱེད་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའམ། འོན་ཏམ་སེམས་སླད་མ་བསྐྱེད་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ།
en: Blessed Lord, do bodhisattva great beings attain consummate buddhahood in unsurpassed, complete enlightenment through their initial setting of the mind on enlightenment, or else do bodhisattva great beings attain consummate buddhahood in unsurpassed, complete enlightenment through their final setting of the mind on enlightenment?

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་སེམས་དང་པོ་བསྐྱེད་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ན་ནི། སེམས་དང་པོ་བསྐྱེད་པ་ཡང་སེམས་སླད་མ་བསྐྱེད་པ་དང་མི་འགྲོགས།
en: Blessed Lord, if bodhisattva great beings attain consummate buddhahood in unsurpassed, complete enlightenment through their initial setting of the mind on enlightenment, {Ki.

source: སེམས་སླད་མ་བསྐྱེད་པ་ཡང་སེམས་དང་པོ་བསྐྱེད་པ་དང་མི་འགྲོགས་ཏེ།
en: IV: 175} then the initial setting of the mind on enlightenment would not be associated with the final setting of the mind on enlightenment, nor would the final setting of the mind on enlightenment be associated with the initial setting of the mind on enlightenment.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་སེམས་ལས་བྱུང་བའི་ཆོས་རྣམས་མི་འགྲོགས་ན། ཇི་ལྟར་དགེ་བའི་རྩ་བ་རྣམས་ཚོགས་སུ་འགྱུར།
en: Blessed Lord, if in that manner the phenomena constituting mind and its mental states are not in association, how will the roots of virtuous action be accumulated?

source: དགེ་བའི་རྩ་བ་མ་བསགས་པར་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་ནུས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Without accumulating the roots of virtuous action, it is impossible to attain consummate buddhahood in unsurpassed, complete enlightenment.” “

source: རབ་འབྱོར་ཁྱོད་ཀྱིས་དོན་འདི་ཉིད་ཤེས་པར་བྱ་བའི་ཕྱིར་དཔེ་བསྟན་ཏེ་འདི་ལ་སྐྱེས་བུ་མཁས་པ་ལ་ལ་བཤད་པའི་དོན་དཔེས་ཡོངས་སུ་ཤེས་པར་འགྱུར་རོ། །རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས།
en: Subhūti,” replied the Blessed One, “in order that you may understand this matter, I will teach an example, since some learned persons understand the meaning that is explained by means of an example.

source: འབྲུ་མར་གྱི་མར་མེ་འབར་བས་སྙིང་པོ་ཚིག་པར་འགྱུར་བ། མེ་ལྕེ་དང་པོ་དང་ཕྲད་པས་སྙིང་པོ་དེ་ཚིག་གམ། དེ་སྟེ་མེ་ལྕེ་ཕྱི་མ་དང་འཕྲད་པས་སྙིང་པོ་དེ་འཚིག །གསོལ་པ།
en: Subhūti, in the case of a burning oil lamp, the wick will be burnt out, but will it be burnt out by the touch of the first flame or will it be burnt out by the touch of the final flame?” “

source: བཅོམ་ལྡན་འདས་མེ་ལྕེ་དང་པོ་དང་མཇལ་པས་ཀྱང་སྙིང་པོ་དེ་འཚིག་པ་མ་ལགས་ལ། མེ་ལྕེ་དང་པོ་ལ་མ་བརྟེན་པར་ཡང་སྙིང་པོ་དེ་འཚིག་པ་མ་ལགས། བཅོམ་ལྡན་འདས་མེ་ལྕེ་སླད་མ་དང་མཇལ་བས་ཀྱང་སྙིང་པོ་དེ་འཚིག་པ་མ་ལགས།
en: Blessed Lord, the wick will not be burnt out by the touch of the first flame, nor will it be burnt out without depending on the first flame.

source: མེ་ལྕེ་སླད་མ་ལ་མ་བརྟེན་པར་ཡང་སྙིང་པོ་དེ་འཚིག་པ་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, the wick will not be burnt out by the touch of the last flame, nor will it be burnt out without depending on the final flame.” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས་འོན་ཀྱང་སྙིང་པོ་དེ་འཚིག་མོད།
en: Well then, Subhūti, do you think that that wick will be burnt out?”

source: བཅོམ་ལྡན་འདས་དེ་ནི་འཚིག་གོ།
en: Blessed Lord, it will be burnt out!

source: །བདེ་བར་གཤེགས་པ་དེ་ནི་འཚིག་གོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Sugata, it will be burnt out!” “

source: རབ་འབྱོར་དེ་དེ་བཞིན་ཏེ། སེམས་དང་པོ་བསྐྱེད་པས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ། སེམས་དང་པོ་བསྐྱེད་པ་ལ་མ་བརྟེན་པར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ། སེམས་ཕྱི་མ་བསྐྱེད་པས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ།
en: Subhūti, in the same way bodhisattva great beings do not attain consummate buddhahood in unsurpassed, complete enlightenment by means of the initial setting of the mind on enlightenment, nor do bodhisattva great beings attain consummate buddhahood in unsurpassed, complete enlightenment independent of the initial setting of the mind on enlightenment.

source: སེམས་ཕྱི་མ་བསྐྱེད་པ་ལ་མ་བརྟེན་པར་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་སྟེ།
en: Bodhisattva great beings do not attain consummate buddhahood in unsurpassed, complete enlightenment by means of the final setting of the mind on enlightenment, nor do bodhisattva great beings attain consummate buddhahood in unsurpassed, complete enlightenment independent of the final setting of the mind on enlightenment.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བ་ཡང་མ་ཡིན་ནོ།
en: And yet, it is not the case that bodhisattva great beings do not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ས་བཅུ་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: In this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, starting from the time when they first set their minds on enlightenment, they will perfect the ten levels and thereafter attain consummate buddhahood in unsurpassed, complete enlightenment.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ས་བཅུ་པོ་གང་དང་གང་ཡོངས་སུ་རྫོགས་པར་བགྱིས་ནས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ལགས་བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what are the ten levels by perfecting which bodhisattva great beings attain consummate buddhahood in unsurpassed, complete enlightenment?” “
